IdeaRS.OpenModel.Result.ResultOnMesh
Data structure for result mesh

IdeaRS.OpenModel.Result.ResultOnMesh.#ctor
Construstor

IdeaRS.OpenModel.Result.ResultOnMesh.Nodes
List of coordinates of mesh nodes.
There are 3 'doubles' for each node (x, y, z)

IdeaRS.OpenModel.Result.ResultOnMesh.PlatesElement
List of elements for each plate UID

IdeaRS.OpenModel.Result.ResultOnMesh.Displacement
Displacements at each node of the mesh in the global x, z ,y

IdeaRS.OpenModel.Result.ResultOnMesh.Value
Values of required type (stress, strain etc.) in nodes